Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
pl: Moduł :mod:`ast` pomaga aplikacjom języka pytonowskiego przetwarzać drzewa abstrakcyjnych gramatyk składni języka pytonowskiego. Abstrakcyjna składnia sama w sobie może ulegać zmianom w każdym wydaniu języka pytonowskiego; ten moduł pozwala dowiedzieć się programowo, jak wygląda obecna gramatyka.

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
pl: Abstrakcyjne drzewo składniowe może być wygenerowane przez przekazanie :data:`ast.PyCF_ONLY_AST` jako flagi dla zadania wbudowanego :func:`compile`, lub używając zadania :func:`parse` - pomocnika dostarczonego z tym modułem. Wynikiem będzie drzewo przedmiotów którego uogólnienia wszystkie dziedziczą po :class:`ast.AST`. Abstrakcyjne drzewo składniowe może być kompilowane do przedmiotu kodu języka pytonowskiego używając wbudowanego zadania :func:`compile`.

source: Node classes
pl: Uogólnienia węzła - z ang. - node

source: This is the base of all AST node classes. The actual node classes are derived from the :file:`Parser/Python.asdl` file, which is reproduced :ref:`below <abstract-grammar>`. They are defined in the :mod:`_ast` C module and re-exported in :mod:`ast`.
pl: To jest podstawą wszystkich uogólnień węzła AST - z ang. - AST node classes. Konkretne uogólnienia węzła dziedziczą po pliku :file:`Parser/Python.asdl` który jest reprodukowany :ref:`poniżej <abstrakcyjnej-gramatyki>. Są one określone w module języka C :mod:`_ast` i ponownie eksportowane w module :mod:`ast`.

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
pl: Istnieje jedno uogólnienie określone dla każdego symbolu lewej strony w abstrakcyjnej gramatyce (na przykład, :class:`ast.stmt` lub :class:`ast.expr`). Na dodatek, istnieje jedno uogólnienie określone dla każdego konstruktora prawej-strony; te uogólnienia dziedziczą po uogólnieniach drzew lewej strony. Dla przykładu, :class:`ast.BinOp` dziedziczy po :class:`ast.expr`. Dla reguł produkcji z alternatywami (in. "sum"), lewa strona jest abstrakcyjna: tylko przykłady szczególnych węzłów konstruktorów są w ogóle kiedykolwiek tworzone.

source: Each concrete class has an attribute :attr:`_fields` which gives the names of all child nodes.
pl: Każde konkretne uogólnienie ma właściwość :attr:`_fields` która daje nazwy wszystkich węzłów potomnych.

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
pl: Każdy przykład konkretnego uogólnienia ma jedną właściwość dla każdego węzła potomnego, o typie zdefiniowanym w gramatyce. Dla przykładu przykłady :class:`ast.BinOp` mają właściwość :attr:`left` o typie :class:`ast.expr`.

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
pl: Jeśli te właściwości są oznaczone jako opcjonalne w gramatyce (używając znaku zapytania) wartość może być ``None``. Jeśli właściwości mogą mieć zero-lub-więcej wartości (określonych za pomocą gwiazdki), wartości są reprezentowane jako listy języka Pyton. Wszystkie możliwe właściwości muszą być obecne i mieć właściwe wartości gdy kompiluje się AST za pomocą zadania :func:`compile`.

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno` and :attr:`col_offset` attributes. The :attr:`lineno` is the line number of source text (1-indexed so the first line is line 1) and the :attr:`col_offset` is the UTF-8 byte offset of the first token that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
pl: Przykłady uogólnień podrzędnych względem :class:`ast.expr` i :class:`ast.stmt` mają właściwości :attr:`lineno` i :attr:`col_offset`. Właściwość :attr:`lineno` jest numerem wiersza w źródłowym tekście (indeksowanym od jednego tak że pierwsza linia odpowiada 1) i :attr:`col_offset` jest przesunięciem w bajtach UTF-8 pierwszego elementu składniowego który wygenerował węzeł. Przesunięcie UTF-8 jest zapisywane ponieważ czytnik używa UTF-8 wewnętrznie.

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
pl: Konstruktor uogólnienia :class:`ast.T` wczytuje swoje parametry jak następuje:

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
pl: Jeśli są parametry pozycyjne, musi być ich tak wiele, jak jest elementów w :attr:`T._fields`; będą przypisane jako właściwości o tych nazwach.

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
pl: Jeśli istnieją parametry słów kluczowych, ustawią one wartości tych samych nazw na zadane wartości.

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
pl: Dla przykładu, aby utworzyć i zapełnić węzeł :class:`ast.UnaryOp`, można użyć::

source: or the more compact ::
pl: lub bardziej zwięźle ::

source: Abstract Grammar
pl: Abstrakcyjna Gramatyka

source: The module defines a string constant ``__version__`` which is the decimal Subversion revision number of the file shown below.
pl: Moduł definiuje stałą ciągu znaków ``__version__`` która jest dziesiątkową liczbą porządkową numerem rewizji Subversion pliku pokazanego poniżej.

source: The abstract grammar is currently defined as follows:
pl: Abstrakcyjna gramatyka jest obecnie określona jak następuje:

source: :mod:`ast` Helpers
pl: Pomocnicy modułu :mod:`ast`

source: Apart from the node classes, :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
pl: Poza uogólnieniami węzła, moduł :mod:`ast` definiuje następujące zadania pomocnicze i uogólnienia dla przeglądania abstrakcyjnych drzew składniowych:

source: Parse an expression into an AST node. Equivalent to ``compile(expr, filename, mode, ast.PyCF_ONLY_AST)``.
pl: Wczytaj wyrażenie do węzła AST. Równoważne z ``compile(expr, filename, mode, ast.PyCF_ONLY_AST)``.

source: Safely evaluate an expression node or a string containing a Python expression. The string or node provided may only consist of the following Python literal structures: strings, numbers, tuples, lists, dicts, booleans, and ``None``.
pl: Bezpiecznie przelicz węzeł wyrażenia lub ciąg zawierający wyrażenie języka Pyton. Ciąg znaków lub dostarczony węzeł mogą tylko składać się z następujących struktur literałów języka Pyton: ciągów, liczb, krotek, list, słowników, wartości logicznych i ``None`` - z ang. - ``Żaden``.

source: This can be used for safely evaluating strings containing Python expressions from untrusted sources without the need to parse the values oneself.
pl: To może być używane dla bezpiecznego obliczania ciągów zawierających wyrażenia języka Pyton z niezaufanych źródeł, bez konieczności przeliczania wartości własnoręcznie.

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`ClassDef` or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
pl: Zwróć ciąg dokumentacji dla danego *węzła* (który musi być węzłem :class:`FunctionDef` lub :class:`ClassDef` lub :class:`Module`), lub ``None`` jeśli nie ma ciągu dokumentacji. Jeśli *clean* jest prawdziwe, posprzątaj wcięcia ciągu dokumentacji za pomocą zadania :func:`inspect.cleandoc`.

source: When you compile a node tree with :func:`compile`, the compiler expects :attr:`lineno` and :attr:`col_offset` attributes for every node that supports them. This is rather tedious to fill in for generated nodes, so this helper adds these attributes recursively where not already set, by setting them to the values of the parent node. It works recursively starting at *node*.
pl: Gdy kompilujesz drzewo węzła za pomocą zadania :func:`compile`, kompilator oczekuje właściwości :attr:`lineno` i :attr:`col_offset` dla każdego węzła które wspiera te właściwości. Jest raczej nużącym wypełnianie wygenerowanych węzłów, więc ten element pomocniczy dodaje te właściwości rekursywnie tam gdzie nie zostały one jeszcze ustawione, przez ustawienie ich na wartości węzła nadrzędnego. Pracuje rekursywnie zaczynając od *węzła* - z ang. - *node*.

source: Increment the line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
pl: Zwiększ numer linii każdego węzła w drzewie zaczynając od *węzła* o *n*. To jest użyteczne aby przesunąć kod do innego położenia w pliku.

source: Copy source location (:attr:`lineno` and :attr:`col_offset`) from *old_node* to *new_node* if possible, and return *new_node*.
pl: Skopiuj źródłowe położenie (właściwości :attr:`lineno` i :attr:`col_offset`) ze *starego węzła* - z ang. - *old_node* do *nowego węzła* - z ang. - *new_node* jeśli to możliwe, i zwróć *nowy węzeł* - z ang. - *new_node*.

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
pl: Wydaj dwójkę ``(nazwa pola, wartość)`` - z ang. - ``(fieldname, value)`` dla każdego pola w ``node._fields`` które jest obecne w *węźle* - z ang. - *node*.

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
pl: Wydaj wszystkie bezpośrednie węzły potomne *węzła*, to jest, wszystkie pola które są węzłami i wszystkie elementy pól które są listami węzłów.

source: Recursively yield all child nodes of *node*, in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
pl: Rekurencyjnie wydaj wszystkie potomne węzły *węzła* - z ang. *node* bez szczególnego porządku. To jest użyteczne jeśli chcesz tylko zmienić węzły w miejscu i nie chcesz troszczyć się o kontekst.

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
pl: Uogólnienie podstawowe wizytującego węzły który przegląda drzewo abstrakcyjnej składni i wywołuje zadanie wizyty dla każdego znalezionego węzła. To zadanie może zwrócić wartość która jest przekazywana przez sposób postępowania :meth:`visit`.

source: This class is meant to be subclassed, with the subclass adding visitor methods.
pl: To uogólnienie jest przeznaczone do wystawienia uogólnienia podrzędnego względem niego, z uogólnieniem podrzędnym dodającym sposoby postępowania wizytujące.

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
pl: Odwiedź węzeł. Domyślne wypełnienie wywołuje sposób postępowania zwany :samp:`self.visit_{nazwauogolnienia}` gdzie *nazwauogolnienia* jest nazwą uogólnienia węzła, lub :meth:`generic_visit` - zastępczych odwiedzin jeśli ten sposób postępowania nie istnieje.

source: This visitor calls :meth:`visit` on all children of the node.
pl: Te odwiedzający wywołuje sposób postępowania :meth:`visit` we wszystkich węzłach potomnych węzła.

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
pl: Zauważ że węzły potomne węzłów które mają dostosowany sposób postępowania odwiedzin nie będą odwiedzane chyba że wizytujący wywoła sposób postępowania :meth:`generic_visit` lub odwiedzi je samodzielnie.

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
pl: Nie używaj uogólnienia :class:`NodeVisitor` jeśli chcesz zastosować zmiany dla węzłów w czasie przeglądania. Do tego celu służy specjalny odwiedzający (:class:`NodeTransformer`), który pozwala na modyfikacje.

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
pl: Uogólnienie :class:`NodeVisitor` podrzędne które przegląda abstrakcyjne drzewo składni i pozwala na modyfikację węzłów.

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
pl: Uogólnienie :class:`NodeTransformer` będzie przeglądało AST (abstrakcyjne drzewo składniowe) i użyje wartości zwracanej sposobu postępowania odwiedzającego do zamiany lub usunięcia starego węzła. Jeśli wartość zwracana sposobu postępowania odwiedzającego jest ``Żadna`` - z ang. - ``None``, węzeł będzie usunięty z jego położenia, w przeciwnym razie zostanie zamieniony na wartość zwracaną. Wartość zwracana może być oryginalnym węzłem w którym to przypadku żadna podmiana nie ma miejsca.

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
pl: Tu jest przykładowy zamiennik, który przepisuje wszystkie wystąpienia podejrzeń nazwy (``foo``) na ``data['foo']``::

source: Keep in mind that if the node you're operating on has child nodes you must either transform the child nodes yourself or call the :meth:`generic_visit` method for the node first.
pl: Pamiętaj że jeśli węzeł na którym wykonujesz operacje ma węzły potomne musisz albo transformować węzły potomne własnoręcznie albo wywołać sposób postępowania :meth:`generic_visit` dla węzła najpierw.

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
pl: Dla węzłów które były częścią kolekcji stwierdzeń (to dotyczy wszystkich węzłów stwierdzeń), odwiedzający może także zwrócić listę węzłów zamiast pojedynczego węzła.

source: Usually you use the transformer like this::
pl: Zwykle używa się zamiennika takiego jak ten::

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. The returned string will show the names and the values for fields. This makes the code impossible to evaluate, so if evaluation is wanted *annotate_fields* must be set to False. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to ``True``.
pl: Zwróć sformatowany zrzut drzewa w węźle. To jest głównie użyteczne dla celów debugowania. Zwrócony ciąg znaków pokaże nazwy i wartości pól. To powoduje że kod jest niemożliwy do obliczenia, więc jeśli obliczenie jest oczekiwane *annotate_fields* musi być ustawione na Fałsz. Właściwości takie jak numery linii i przesunięcia kolumn nie są zrzucane domyślnie. Jeśli jest to oczekiwane, można ustawić *include_attributes* na Prawdę - z ang - ``True``.

source: :mod:`asynchat` --- Asynchronous socket command/response handler
pl: :mod:`asynchat` --- Asynchroniczna obsługa gniazda komend/odpowiedzi.

source: This module builds on the :mod:`asyncore` infrastructure, simplifying asynchronous clients and servers and making it easier to handle protocols whose elements are terminated by arbitrary strings, or are of variable length. :mod:`asynchat` defines the abstract class :class:`async_chat` that you subclass, providing implementations of the :meth:`collect_incoming_data` and :meth:`found_terminator` methods. It uses the same asynchronous loop as :mod:`asyncore`, and the two types of channel, :class:`asyncore.dispatcher` and :class:`asynchat.async_chat`, can freely be mixed in the channel map. Typically an :class:`asyncore.dispatcher` server channel generates new :class:`asynchat.async_chat` channel objects as it receives incoming connection requests.
pl: Ten moduł buduje na infrastrukturze modułu :mod:`asyncore`, upraszczając klientów i serwery asynchroniczne i czyniąc łatwiejszym obsługę protokołów których elementy są zakańczane przez zadane ciągi znaków, lub są zmiennej długości. Moduł :mod:`asynchat` określa abstrakcyjne uogólnienie :class:`async_chat` które możesz dostosować tworząc własne podrzędne uogólnienie, dostarczając wypełnień sposobów postępowania :meth:`collect_incoming_data` i :meth:`found_terminator`. Używa tej samej asynchronicznej pętli co moduł :mod:`asyncore`, i dwóch rodzajów kanałów, - :class:`asyncore.dispatcher` i :class:`asynchat.async_chat`, mogą być dowolnie być mieszane w mapie kanałów. Typowo kanał serwera :class:`asyncore.dispatcher` generuje nowe przedmioty kanałów :class:`asynchat.async_chat` gdy otrzymuje wchodzące zapytania o połączenie.

source: This class is an abstract subclass of :class:`asyncore.dispatcher`. To make practical use of the code you must subclass :class:`async_chat`, providing meaningful :meth:`collect_incoming_data` and :meth:`found_terminator` methods. The :class:`asyncore.dispatcher` methods can be used, although not all make sense in a message/response context.
pl: To uogólnienie jest abstrakcyjnym uogólnieniem podrzędnym względem uogólnienia :class:`asyncore.dispatcher`. Aby praktycznie użyć kodu musisz dostosować podrzędne uogólnienie względem uogólnienia :class:`async_chat`, dostarczając sensownego wypełnienia sposobu postępowania :meth:`collect_incoming_data` i sposobu postępowania :meth:`found_terminator`. Sposoby postępowania uogólnienia :class:`asyncore.dispatcher` mogą być używane, chociaż nie wszystkie mają sens w kontekście wiadomość/odpowiedź.

source: Like :class:`asyncore.dispatcher`, :class:`async_chat` defines a set of events that are generated by an analysis of socket conditions after a :cfunc:`select` call. Once the polling loop has been started the :class:`async_chat` object's methods are called by the event-processing framework with no action on the part of the programmer.
pl: Tak jak w uogólnieniu :class:`asyncore.dispatcher` :class:`async_chat` określa zestaw zdarzeń które są generowane przez analizę warunków gniazda po wywołaniu zadania :cfunc:`select`. Gdy pętla sprawdzenia urządzenia została rozpoczęta sposoby postępowania uogólnienia :class:`async_chat` są wywoływane w szkielecie przetwarzającym zdarzenia bez ingerencji programisty.

source: Two class attributes can be modified, to improve performance, or possibly even to conserve memory.
pl: Dwie właściwości uogólnienia mogą być modyfikowane, aby poprawić wydajność, lub nawet aby możliwie oszczędzać pamięć.

source: The asynchronous input buffer size (default ``4096``).
pl: Rozmiar przestrzeni wymiany wejściowej asynchronicznej (domyślnie ``4096``).

source: The asynchronous output buffer size (default ``4096``).
pl: Rozmiar przestrzeni wymiany wyjściowej asynchronicznej (domyślnie ``4096``).

source: Unlike :class:`asyncore.dispatcher`, :class:`async_chat` allows you to define a first-in-first-out queue (fifo) of *producers*. A producer need have only one method, :meth:`more`, which should return data to be transmitted on the channel. The producer indicates exhaustion (*i.e.* that it contains no more data) by having its :meth:`more` method return the empty string. At this point the :class:`async_chat` object removes the producer from the fifo and starts using the next producer, if any. When the producer fifo is empty the :meth:`handle_write` method does nothing. You use the channel object's :meth:`set_terminator` method to describe how to recognize the end of, or an important breakpoint in, an incoming transmission from the remote endpoint.
pl: W przeciwieństwie do uogólnienia :class:`asyncore.dispatcher`, uogólnienie :class:`async_chat` pozwala ci definiować kolejkę pierwszy-na-wejściu-pierwszy-na-wyjściu (fifo) *producentów*. Producent potrzebuje mieć tylko jeden sposób postępowania :meth:`more` - z ang. - :meth:`więcej`, który powinien zwrócić dane do transmisji w kanale. Producent zaznacza wyczerpanie (t.j. że nie posiada więcej danych) przez to że jego sposób postępowania :meth:`more` zwróci pusty ciąg znaków. W tym momencie przedmiot :class:`async_chat` zdejmuje producenta z kolejki fifo i zaczyna używać następnego producenta jeśli taki występuje. Gdy kolejka fifo producenta jest pusta sposób postępowania :meth:`handle_write` nie robi nic. Używa się sposobu postępowania :meth:`set_terminator` przedmiotu kanału aby opisać jak rozpoznać koniec, lub istotny przerywnik w nadchodzącym sygnale z punktu widzenia odległego krańca transmisji.

source: To build a functioning :class:`async_chat` subclass your input methods :meth:`collect_incoming_data` and :meth:`found_terminator` must handle the data that the channel receives asynchronously. The methods are described below.
pl: Aby zbudować funkcjonujące podrzędne uogólnienia względem uogólnienia :class:`async_chat`, twoje sposoby postępowania wprowadzania :meth:`collect_incoming_data` i :meth:`found_terminator` muszą obsługiwać dane które kanał otrzymuje asynchronicznie. Sposoby postępowania są opisane poniżej.

source: Pushes a ``None`` on to the producer fifo. When this producer is popped off the fifo it causes the channel to be closed.
pl: Przepycha ``Żaden`` - z ang. - ``None`` na kolejkę producenta. Gdy producent jest pobierany z wierzchu kolejki fifo, powoduje, że kanał jest zamykany.

source: Called with *data* holding an arbitrary amount of received data. The default method, which must be overridden, raises a :exc:`NotImplementedError` exception.
pl: Wywoływany z *danymi* przechowując określoną ilość otrzymanych danych. Domyślny sposób postępowania, który musi zostać przesłonięty, zgłasza wyjątek :exc:`NotImplementedError`.

source: In emergencies this method will discard any data held in the input and/or output buffers and the producer fifo.
pl: W wyjątkowych sytuacjach ten sposób postępowania odrzuci dowolne dane przechowywane w przestrzeniach wymiany wejściowej i/lub wyjściowej i kolejce producenta fifo.

source: Called when the incoming data stream matches the termination condition set by :meth:`set_terminator`. The default method, which must be overridden, raises a :exc:`NotImplementedError` exception. The buffered input data should be available via an instance attribute.
pl: Wywoływana gdy przychodzący strumień danych odpowiada warunkowi zakończenia ustawionemu przez sposób postępowania :meth:`set_terminator`. Domyślny sposób postępowania, który musi być przesłonięty, zgłasza wyjątek :exc:`NotImplementedError`. Dane wejściowe z przestrzeni wymiany powinny być dostępne przez właściwość przykładu.
